ChartsOfCharacteristicTypes/скт_ДополнительныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>скт_ДополнительныеНастройки</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимПароля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/скт_ЗначенияДополнительныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>скт_ЗначенияДополнительныхНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.скт_ДополнительныеНастройки</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.скт_ДополнительныеНастройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/скт_ДополнительныеНастройки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПрочитатьЗначение(КодНастройки, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Настройка = НайтиПоКоду(КодНастройки);
	Если Настройка.Пустая() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ПолучитьЗначениеПоСсылке(Настройка);

КонецФункции // ПрочитатьЗначение()

Функция УстановитьЗначение(Ссылка, Значение) Экспорт

	РегистрыСведений.скт_ЗначенияДополнительныхНастроек.ЗаписатьНастройку(Ссылка, Значение);
	
КонецФункции // УстановитьЗначение()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗначениеПоСсылке(Ссылка) Экспорт

	Возврат РегистрыСведений.скт_ЗначенияДополнительныхНастроек.ПрочитатьНастройку(Ссылка);

КонецФункции // ПолучитьЗначение()
	
#КонецОбласти

#КонецЕсли
